{
    "case_metadata": {
        "case_id": "10072",
        "title": "Case 10072: A Canadian widow of fifty-nine with stupor, cough and chest pain",
        "source": {
            "journal": "The New England Journal of Medicine"
        }
    },
    "patient_info": {
        "age": 59,
        "gender": "F",
        "demographics": {
            "ethnicity": "Canadian",
            "occupation": "Practical nurse",
            "living_arrangement": "Widow"
        },
        "social_history": {
            "sleep_habits": "Often went without sleep due to work, probably little sleep in the past three months."
        },
        "medical_history": {
            "allergies": "Unknown",
            "past_medical_conditions": "Pneumonia five years ago, lump on chest with suffocation thirteen months ago (physician said high blood pressure and bad heart), pleurisy (?) two months before admission.",
            "medications": "Strychnin capsules (incorrectly stated, likely amyl nitrite), cough medicine (possibly contained codeine or morphine - speculated by Dr. Cabot)."
        },
        "surgical_history": {}
    },
    "participants": {
        "clinicians": {
            "Doctor A": {
                "specialty": "General Medicine / Case Discussion Leader",
                "role": "Presenter",
                "real_name": "Dr. Richard C Cabot"
            },
            "Doctor B": {
                "specialty": "Pathology",
                "role": "Discussant",
                "real_name": "Dr. Richardson"
            }
        },
        "others": {
            "Family Member 1": {
                "role": "Informant",
                "relation": "Daughter"
            },
            "Family Member 2": {
                "role": "Informant",
                "relation": "Granddaughter"
            },
            "Patient": {
                "role": "Patient"
            }
        }
    },
    "conversation": {
        "turn_1": {
            "speaker": "Family Member 1",
            "listeners": [
                "Nurse A"
            ],
            "real_name": null,
            "timestamp": "November 8, Emergency Ward Admission",
            "message": "Doctor, my mother, she's 59. We brought her in because she's in a stupor. She's been complaining of chest pain and coughing.",
            "intention": "Inform nurse about patient's condition and chief complaints upon arrival at the Emergency Ward.",
            "context": "Patient brought to Emergency Ward in stupor.",
            "source_reference": "Page 1: 'A Canadian widow of fifty-nine, a practical nurse, was brought to the Emergency Ward November 8 in stupor. The history was given by her daughter and granddaughter. The complaints were of pain in the chest, cough and stupor.'"
        },
        "turn_2": {
            "speaker": "Family Member 2",
            "listeners": [
                "Nurse A",
                "Family Member 1"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 1, November 8, Emergency Ward Admission",
            "message": "Yes, and for family history, her sister died of tuberculosis and another daughter, my aunt, died of a 'growth on the liver'. We don't know about other causes of death in the family.",
            "intention": "Provide family medical history to the nurse.",
            "context": "Providing family history upon nurse's request or as part of admission.",
            "source_reference": "Page 1: 'One sister died of tuberculosis. One daughter died of \"growth on the liver.\" No other causes of death were known.'"
        },
        "turn_3": {
            "speaker": "Family Member 1",
            "listeners": [
                "Nurse A",
                "Family Member 2"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 2, November 8, Emergency Ward Admission",
            "message": "And about her habits, she is a practical nurse and often doesn't sleep much because of her work.  She probably hasn’t slept well for the last three months.",
            "intention": "Explain patient's habits regarding sleep which might be relevant to her current condition.",
            "context": "Providing social history to the nurse.",
            "source_reference": "Page 1: 'In the course of her work she often went without sleep. She had probably had little sleep during the past three months.'"
        },
        "turn_4": {
            "speaker": "Family Member 2",
            "listeners": [
                "Nurse A",
                "Family Member 1"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 3, November 8, Emergency Ward Admission",
            "message": "She's always been very active and worked hard. Five years ago she had pneumonia. About thirteen months ago, she had a lump on her chest and felt like she was suffocating. The doctor said it was high blood pressure and a bad heart then.",
            "intention": "Provide past medical history details to the nurse.",
            "context": "Continuing to give past medical history.",
            "source_reference": "Page 1: 'She had always been very active and had worked hard. Five years ago she had pneumonia. Thirteen months ago she had a lump on her chest with suffocation. A physician said she had high blood pressure and a bad heart.'"
        },
        "turn_5": {
            "speaker": "Family Member 1",
            "listeners": [
                "Nurse A",
                "Family Member 2"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 4, November 8, Emergency Ward Admission",
            "message": "Yes, and they even told her she only had ten minutes to live back then.  She was also given these capsules to break open and inhale when she had those suffocating attacks. Oh, and she had pleurisy, or we think it was, about two months ago.",
            "intention": "Provide further details on past medical episodes and treatments.",
            "context": "Adding more details to past medical history.",
            "source_reference": "Page 1: 'She was given ten minutes to live. She was also given strychnin capsules to break and inhale. She had often had suffocating attacks. Two months before admission she had pleurisy (?).'"
        },
        "turn_6": {
            "speaker": "Family Member 2",
            "listeners": [
                "Nurse A",
                "Family Member 1"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 5, November 8, Emergency Ward Admission",
            "message": "This recent trouble started on November 3rd. She felt tired and achy all over after leaving a patient's house and thought it was pleurisy again.  She couldn't get out of bed the next day. Then she started coughing up blood and white foamy stuff the day after. She’s been feeling hot and cold and suffocated since then. Day before yesterday, the 6th, she got a bad pain in her right side and we called a doctor.",
            "intention": "Describe the present illness timeline and symptoms.",
            "context": "Describing the progression of current symptoms leading to admission.",
            "source_reference": "Page 1: 'November 3, after leaving a case, she was tired, had pains all over, did not feel well, and felt that she had another attack of pleurisy. November 4 she stayed in bed because she felt unable to get up. Next day she developed a cough with hemoptysis and occasional white foamy sputum. Since the onset she had had alternate feelings of cold and heat with suffocation. November 6 she developed severe pain in her right side.'"
        },
        "turn_7": {
            "speaker": "Family Member 1",
            "listeners": [
                "Nurse A",
                "Family Member 2"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 6, November 8, Emergency Ward Admission",
            "message": "The doctor gave us two prescriptions. The pharmacist said the capsules were to 'deaden the pain' and the liquid was 'cough medicine'. He also said we couldn't refill them without duplicates from the doctor. We gave her the first capsule last night and the second this morning. She hasn’t had the third one. We’ve been giving her the cough medicine every two hours.  Then at four o'clock this afternoon, after she ate a good meal, she just became stuporous and we couldn’t wake her up.",
            "intention": "Explain recent medication administration and the onset of stupor.",
            "context": "Explaining medication usage and the event leading to emergency visit.",
            "source_reference": "Page 1: 'A doctor gave her two prescriptions for both of which the person who had them filled had to sign. The apothecary said that the capsules were \"to deaden the pain\" and the liquid was \"a cough medicine.\" He also said the prescription would not be refilled without duplicates from the physician. The first capsule was given the night of November 7 and the second the morning of admission. The third had not been given. The cough medicine was given every two hours. At four o'clock, after eating fairly heartily, the patient became stuporous and could not be aroused.'"
        },
        "turn_8": {
            "speaker": "Nurse A",
            "listeners": [
                "Family Member 1",
                "Family Member 2"
            ],
            "real_name": null,
            "timestamp": "Immediately after Turn 7, November 8, Emergency Ward Examination",
            "message": "Thank you for the information. We’ll get her assessed right away. Please wait here.",
            "intention": "Acknowledge receipt of information and assure family of patient assessment.",
            "context": "Ending history taking and proceeding to patient examination.",
            "source_reference": "Page 1: 'The examination was not complete because of her condition.'"
        },
        "turn_9": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "During Case Discussion",
            "message": "We have a 59-year-old woman, a practical nurse, admitted in stupor. Given her age, cerebral hemorrhage or a vascular event comes to mind first, the most common cause of coma at this age.",
            "intention": "Start differential diagnosis discussion based on initial presentation.",
            "context": "Beginning discussion of the case among clinicians.",
            "source_reference": "Page 2: 'A woman of fifty-nine found in stupor brings to mind at once the commonest of all causes of coma in persons of this age, namely cerebral hemorrhage or its equivalent in other vascular accidents.'"
        },
        "turn_10": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 9, During Case Discussion",
            "message": "Since she's a nurse, we should also consider morphine overdose, although habituated users rarely get into stupor from it.",
            "intention": "Consider another possible cause of stupor related to patient's profession.",
            "context": "Continuing differential diagnosis.",
            "source_reference": "Page 2: 'As the patient is a nurse one also is forced to remember that many nurses, like many physicians, get the morphin habit, and that an overdose of morphin is a possible cause of stupor, though in fact those who are habituated to it seldom get this particular effect from it.'"
        },
        "turn_11": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 10, During Case Discussion",
            "message": "But with the cough and chest pain along with stupor, infection, especially respiratory infection, seems more likely as the cause of her unconsciousness.",
            "intention": "Shift focus to infectious causes due to associated symptoms.",
            "context": "Refining differential diagnosis based on additional symptoms.",
            "source_reference": "Page 2: 'As we read on, however, and find that there is cough and pain in the chest as well as stupor, it becomes more probable that the unconsciousness is part of the manifestations of an infections disease, and very possibly of arespiratory infection.'"
        },
        "turn_12": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 11, During Case Discussion",
            "message": "And with a sister who died of tuberculosis, we must consider TB, although the acute onset of symptoms over just five days makes chronic TB less likely, though acute presentations are possible.",
            "intention": "Consider tuberculosis given family history but acknowledge the acute presentation.",
            "context": "Considering specific infectious etiologies.",
            "source_reference": "Page 2: 'Since one sister died of tuberculosis one wonders whether the respiratory infection here in question may be tuberculosis. From the facts given us we do not know whether this patient was actually exposed to tuberculosis or not. In point of fact, however, the acuteness of the symptoms in this case, the fact that the patient has been ill only five days, make it rather improbable that so chronic a disease as tuberculosis is present. Tuberculosis can begin acutely and deprive the patient of life within a few days, but this is unusual.'"
        },
        "turn_13": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 12, During Case Discussion",
            "message": "The history of a 'lump on her chest' with suffocation... aneurysm could be considered, but there's no current sign of it, and the previous doctor didn't seem to think so. Probably just a prominence she noticed and misinterpreted.",
            "intention": "Discuss the 'lump on chest' history, considering aneurysm but downplaying its likelihood.",
            "context": "Addressing specific points from past medical history.",
            "source_reference": "Page 2: 'What was the lump on her chest with suffocation thirteen months ago? What could that have been? Aneurism of course comes to our mind, but with no trace of any such thing at the present time and with no evidence that her physician considered aneurism it seems to me more probable that there was no lump of any size there and that the patient's phraseology has misled us.'"
        },
        "turn_14": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 13, During Case Discussion",
            "message": "More importantly, she had high blood pressure and heart issues before. She likely has cardiac hypertrophy and dilatation now.",
            "intention": "Highlight the significance of past cardiac history.",
            "context": "Emphasizing relevant past medical conditions.",
            "source_reference": "Page 2: 'More important in the past history is the account of high blood pressure with poor heart action. If that was true in the past she probably has some hypertrophy and dilatation of the heart at the present time.'"
        },
        "turn_15": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 14, During Case Discussion",
            "message": "About those 'strychnin capsules' to inhale... they were almost certainly amyl nitrite, not strychnine.",
            "intention": "Correct the likely misinterpretation of 'strychnin capsules'.",
            "context": "Clarifying details from patient history.",
            "source_reference": "Page 2: 'What was the nature of the capsules which she was given to break and inhale? Certainly they were not strychnin capsules, as the record states. Probably they contained amyl nitrite.'"
        },
        "turn_16": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "Immediately after Turn 15, During Case Discussion",
            "message": "Back to the present illness, acute respiratory infection, chest pain, cough, hemoptysis, fever... sounds like pneumonia. But the stupor is unusual for pneumonia, making me wonder about those pain capsules and cough medicine. They said 'to deaden pain', so morphine is possible in the capsules. But two doses, spaced out, probably wouldn't cause coma. Maybe the cough medicine also had morphine or codeine? Unlikely both, though. So, I still lean towards stupor being from the same infection.",
            "intention": "Re-evaluate differential diagnosis, focusing on pneumonia and re-considering medication effect on stupor.",
            "context": "Integrating present illness symptoms into differential diagnosis.",
            "source_reference": "Page 2: 'Coming now to the present illness we have an acute onset of arespiratory infection, with chest pain, cough, hemoptysis and fever. So far it sounds like an ordinary pneumonia. The onset of stupor, however, is a surprising feature of the case if it is pneumonia, and it is for this reason that the inquiries about the two capsules are instituted. Since they were given to deaden pain there is every reason to suppose that they contained morphin. It is not likely, however, that they contained enough so that two of them, spaced as these have been, could have accounted for the patient's coma. Possibly the cough medicine also contained morphin. This has been given more frequently, but the ordinary traditions of the medical profession seem to me to make it unlikely that there was morphin both in the capsules and in the cough medicine. There may have been codeia in the latter, but this also I should think was rather improbable. On the whole then I incline to think that the stupor must have been due to the same cause as the other apparently infectious symptoms, and has no particular relation to anything that she has taken as medicine.'"
        },
        "turn_17": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "After reviewing physical exam notes",
            "message": "Physical exam shows solidification at the right apex. Could be TB or pneumonia, likely pneumonia given the short illness duration.  Heart irregularities fit with pneumonia, urine and blood results aren't detailed enough to sway us yet.",
            "intention": "Incorporate physical exam findings to narrow down differential diagnosis.",
            "context": "Reviewing physical exam findings during case discussion.",
            "source_reference": "Page 2: 'In the physical examination the outstanding and important fact is the evidence of solidification at the right apex. As described it might be due to tuberculosis or to pneumonia, but not to anything else in all probability. As the patient lived only one day in the hospital, with five days outside it since the beginning of this infection, it is distinctly improbable that tuberculosis is the cause. Pneumonia then, our first supposition, seems to be supported by more and more evidence as we go on through the account of the case. The irregularities of the heart are such as are often seen in pneumonia and do not po.nt to any separate disease of that organ. And though the urine is not recorded we have no reason to suppose that it showed anything besides the results of the infection. The same is true of the blood.'"
        },
        "turn_18": {
            "speaker": "Doctor A",
            "listeners": [
                "Doctor B"
            ],
            "real_name": "Dr. Richard C Cabot",
            "timestamp": "After reviewing notes on the patient's last day",
            "message": "The last day's notes don't change my mind. Pneumonia or TB, but pneumonia is much more probable. I expect necropsy to show extensive right lung pneumonia, maybe some in the left too. Usual infection signs, pleuritis, possibly purulent. Stupor from pneumonia itself. Pre-existing heart issues, but no aneurysm evidence.",
            "intention": "Solidify diagnosis of pneumonia based on clinical course and predict necropsy findings.",
            "context": "Concluding differential diagnosis before necropsy results.",
            "source_reference": "Page 2: 'The account of the last day of life adds nothing to make us change the impression just expressed. As far as I see this patient must have died either of pneumonia or of pulmonary tuberculosis, and while the latter cannot be absolutely excluded there seems to me every reason for considering the former the most probable diagnosis. I believe then that the necropsy will show extensive pneumonia of the right lung and very possibly some of the same disease in the left, though we have no positive evidence of that during life. The other organs should show the usual evidences of an acute infection, and the pleura should show an acute inflammation, very possibly with the accumulation of a fluid, serous or purulent, which did not make itself obvious in the physical examination. Purulent pleurisy is a particularly common complication in a case like this. I do not believe that the stupor was connected with any cause other than the pneumonia. Probably there will be some hypertrophy and dilatation of the heart, but there is no evidence of any further disease there, or on the whole any good evidence of aneurism.'"
        },
        "turn_19": {
            "speaker": "Doctor B",
            "listeners": [
                "Doctor A"
            ],
            "real_name": "Dr. Richardson",
            "timestamp": "Presenting Anatomical Diagnosis",
            "message": "The necropsy showed septicemia from pneumococcus and lobar pneumonia as primary fatal lesions, just as we suspected. Secondary lesions were arteriosclerosis, heart hypertrophy and dilatation, and a soft spleen. Historical landmarks included slight chronic pleuritis, chronic perihepatitis and splenitis, a uterine polyp, hydrosalpinx, and obsolete TB in a bronchial gland. Head wasn't examined.",
            "intention": "Present anatomical findings from necropsy.",
            "context": "Sharing necropsy results during case discussion.",
            "source_reference": "Page 3: 'Dr. Richardson : This case was that of a well developed and fairly well nourished woman. The head was not examined. The gastro-intestinal tract was negative except there were a few small smooth walled intact diverticula in the sigmoid colon. The pleural cavities were empty. There were a few old pleural adhesions on each side. The trachea and bronchi contained much mucopurulent material and the mucosa showed dirty reddish discoloration. The bronchial glands were moderately enlarged, pigmented and generally soft and juicy. One of the glands, however, at the bifurcation of the trachea showed fibrocalcareous degeneration, obsolete tuberculosis. The upper lobe of the right lung was voluminous, solid, and coated with fibrinous exúdate. The section surfaces were gray-red to gray, homogeneous, granular, and yielded much mucopurulent fluid material. The pneumonia involved the apex, which otherwise was negative. The middle lobe was rather voluminous, solid and showed gray-red to gray pneumonia. The lower lobe in the region of its upper part posteriorly over about one-third of its volume showed gray-red to gray pneumonia, and anteriorly a short distance below this there was a focus of gray-red pneumonia about four and one-half cm. in diameter. The tissue of the lobe elsewhere was purplish red, spongy, and yielded a small amount of thin reddish frothy fluid. The apex of the left lung was negative. From a point about 4 cm. below the apex and down to the diaphragm the upper lobe was solid and showed gray-red to gray pneumonia. In the region of the middle portion of the lower lobe posteriorly to the left there was an area of grayred pneumonia about 5-7 cm. The tissue of this lobe elsewhere was purplish red, spongy, and yielded a moderate amount of reddish frothy fluid. The heart weighed 500 grams, considerably enlarged. The myocardium was of good consistence, pale brown-red, and showed no evidence of myocarditis. The cavities were of full size on the left and showed slight dilatation on the right. The mitral and aortic valves showed a moderate amrv nt of the usual fibrosis, but the valves were otherwise negative. The coronarles were free, but showed scattered along the intima some fibrous sclerosis, without, however, any marked diminution of their lumina. The aorta and the great branches generally showed much fibrous sclerosis. The liver weighed 1660 grams. The organ presented a few old adhesions to the diaphragm. The cut ends of the branches of the hepatic artery in the section surfaces showed fibrous sclerosis. The spleen weighed 105 grams, rather small. The tissue was rather mushy. The organ presented a few old adhesions to the diaphragm. The combined weight of the kidneys was 330 grams. The organs showed arteriosclerosis with some atrophy in places; no definite nephritis. The uterus was rather small and presented a small polyp springing from the mucosa of the upper part of the uterine cavity. The tubes were negative except for a slight hydrosalpinx on the left. The ovaries showed fibroid atrophy. Culture from the heart blood yielded a good growth of the pneumococcus. A typical case of lobar pneumonia in an arteriosclerotic.'"
        },
        "turn_20": {
            "speaker": "Doctor B",
            "listeners": [
                "Doctor A"
            ],
            "real_name": "Dr. Richardson",
            "timestamp": "Immediately after Turn 19, Presenting Anatomical Diagnosis",
            "message": "The lungs showed extensive lobar pneumonia, particularly in the right upper and middle lobes, and left upper lobe. Heart was enlarged, 500 grams, with arteriosclerosis and some valve fibrosis. Spleen was mushy. Kidneys showed arteriosclerosis. Culture from heart blood grew pneumococcus. Typical lobar pneumonia in an arteriosclerotic patient.",
            "intention": "Summarize key anatomical findings.",
            "context": "Concluding presentation of necropsy findings.",
            "source_reference": "Page 3: 'The upper lobe of the right lung was voluminous, solid, and coated with fibrinous exúdate... The heart weighed 500 grams, considerably enlarged... Culture from the heart blood yielded a good growth of the pneumococcus. A typical case of lobar pneumonia in an arteriosclerotic.'"
        }
    },
    "clinical_data": {
        "presentation": {
            "chief_complaint": "Stupor, chest pain, cough",
            "history_of_present_illness": "5-day history of illness starting with tiredness and body pain, followed by cough, hemoptysis, fever, and stupor on the day of admission.",
            "physical_exam": "Elderly woman in stupor, slight cyanosis, slow and spasmodic respirations with expiratory grunt, irregular heart action, soft systolic murmur at apex, B.P. 150/90, marked dullness in right apex with bronchial breathing, crackling râles, increased voice sounds and fremitus, scattered râles below scapulae.",
            "vital_signs": {
                "initial": {
                    "temperature": "101.5°-104°F (rectal)",
                    "pulse": "52-120 bpm",
                    "respiratory_rate": "26-36/min",
                    "blood_pressure": "150/90 mm Hg"
                }
            }
        },
        "diagnostics": {
            "laboratory_data": [
                {
                    "test": "Leukocytes",
                    "value": "32,000",
                    "units": "/mm³",
                    "reference_range": "Not specified"
                },
                {
                    "test": "Polynuclears",
                    "value": "93%",
                    "units": "%",
                    "reference_range": "Not specified"
                },
                {
                    "test": "Platelets",
                    "value": "Almost absent",
                    "units": "N/A",
                    "reference_range": "Not specified"
                },
                {
                    "test": "Red blood cells",
                    "value": "Great variation in size, microcytes, no poikilocytes",
                    "units": "N/A",
                    "reference_range": "Not specified"
                }
            ],
            "imaging": [
                {
                    "modality": "Electrocardiogram",
                    "description": "Auricular premature beats, usually every second or third beat. Rate 110-120. T2 inverted. Left axis deviation. Index -f- 35."
                }
            ]
        },
        "procedures": [
            {
                "procedure": "Digifolin",
                "description": "gr. ii intravenously and gr. ss intramuscularly",
                "time": "November 8, Emergency Ward"
            },
            {
                "procedure": "Caffein",
                "description": "gr. x intravenously",
                "time": "November 8, Emergency Ward"
            },
            {
                "procedure": "Individual precautions",
                "description": "Not specified",
                "time": "November 8 onwards"
            },
            {
                "procedure": "Force fluids",
                "description": "Not specified",
                "time": "November 8 onwards"
            },
            {
                "procedure": "Soapsuds enema",
                "description": "In the morning if condition permits",
                "time": "November 9 (attempted)"
            },
            {
                "procedure": "Morphia",
                "description": "gr. 1/8 every six hours p.r.n. (Not given)",
                "time": "Order on November 8, not administered"
            },
            {
                "procedure": "Caffein sodium salicylate",
                "description": "gr. x intramuscularly p.r.n. for respiratory failure",
                "time": "November 8, and November 9 every three hours"
            },
            {
                "procedure": "Pituitrin",
                "description": "1 c.c intramuscularly",
                "time": "November 9"
            },
            {
                "procedure": "Turpentine stupes",
                "description": "every four hours p.r.n. for distention",
                "time": "November 9"
            },
            {
                "procedure": "Atropin",
                "description": "gr. 1/100 s.c",
                "time": "November 9"
            }
        ],
        "timeline_events": [
            {
                "time": "5 years prior to admission",
                "event": "Pneumonia"
            },
            {
                "time": "13 months prior to admission",
                "event": "Lump on chest, suffocation, diagnosed with high blood pressure and bad heart"
            },
            {
                "time": "2 months prior to admission",
                "event": "Pleurisy (?)"
            },
            {
                "time": "November 3",
                "event": "Onset of present illness: tiredness, body pains, feeling unwell"
            },
            {
                "time": "November 4",
                "event": "Stayed in bed, unable to get up"
            },
            {
                "time": "November 5",
                "event": "Developed cough with hemoptysis and white foamy sputum, alternate feelings of cold and heat with suffocation"
            },
            {
                "time": "November 6",
                "event": "Severe pain in right side, saw a doctor, received prescriptions"
            },
            {
                "time": "November 7",
                "event": "First capsule given at night"
            },
            {
                "time": "November 8, Morning",
                "event": "Second capsule given"
            },
            {
                "time": "November 8, 4:00 PM",
                "event": "After eating, patient became stuporous and could not be aroused"
            },
            {
                "time": "November 8, Evening",
                "event": "Admission to Emergency Ward"
            },
            {
                "time": "November 9, Night",
                "event": "Respiration worsened despite caffeine, both sphincters relaxed, pronounced distention, died just after midnight"
            }
        ],
        "final_diagnoses": [
            "Clinical Diagnosis (from hospital record): Lobar pneumonia.",
            "Dr. Richard C Cabot's Diagnosis: Lobar pneumonia, Hypertrophy and dilatation of the heart, Acute pleuritis.",
            "Anatomical Diagnosis: Septicemia, pneumococcus, Lobar pneumonia, Arteriosclerosis, Hypertrophy and dilatation of the heart, Soft spleen, Slight chronic pleuritis, Chronic perihepatitis and splenitis, Small polyp of the uterus, Hydrosalpinx, left, Obsolete tuberculosis of a bronchial gland."
        ]
    },
    "case_id": "NEJM192402141900715",
    "original_case_number": "NEJM192402141900715",
    "final_diagnosis": "N/A"
}